## Pandas란?

데이터를 수정하고 변경시키기 위해 중요한 Python 라이브러리

### Data Frame
엑셀과 유사하게 생긴 행/렬 데이터 형식
- 엑셀과 달리 프로그램화 가능
- numpy를 사용하고 있어 숫자 연산에 강력함

### Series 

Data Frame 내의 하나의 column -> 시리즈( Series )

시리즈는 Python list로 만들 수 있음 

따라서 Data Frame은 Series의 집합 ...

In [3]:
s1 = pd.core.series.Series( [1, 2, 3] )
s2 = pd.core.series.Series( ['one', 'two', 'three'] )
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

## Pandas Tutorial

### 파일에서 데이터 불러오기

In [4]:
!conda list | grep pandas

pandas                    1.4.1                    pypi_0    pypi

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('data/friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df.head(2) # 처음부터 N개 데이터만 출력 ... 기본 값은 5

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [8]:
df.tail(3) # 뒤에서 N개

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [13]:
# 콤마나 탭 + 줄바꿈으로 구분되어 있는 txt 파일도 불러올 수 있음
# tab으로 구분되어 있을 경우 delimiter 인자도 넣어줘야 함
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
# 항상 첫번째 행은 column의 이름 -> 이름이 없을 경우엔 header=None 인자를 넣어줌
# 이름이 없을 경우엔 .columns를 이용해 직접 넣어줄 수 있음
df = pd.read_csv('data/friend_list_no_head.csv', header=None)
df.columns = ['name', 'age', 'job']
# 불러오면서 한 번에 처리도 가능 ! 
# df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern